// src/data/provinces.ts

export interface Province {
  name: string
  cities: string[]
}

export const PROVINCES_CITIES: Province[] = [
  { name: "تهران", cities: ["تهران", "شهریار", "اسلامشهر", "ورامین", "دماوند"] },

  { name: "البرز", cities: ["کرج", "نظرآباد", "هشتگرد", "طالقان"] },

  { name: "اصفهان", cities: ["اصفهان", "کاشان", "نجف‌آباد", "خمینی‌شهر", "شاهین‌شهر"] },

  { name: "فارس", cities: ["شیراز", "مرودشت", "جهرم", "فسا", "لار"] },

  { name: "خراسان رضوی", cities: ["مشهد", "نیشابور", "سبزوار", "تربت حیدریه", "قوچان"] },

  { name: "خراسان شمالی", cities: ["بجنورد", "شیروان", "اسفراین"] },

  { name: "خراسان جنوبی", cities: ["بیرجند", "قائن", "طبس"] },

  { name: "آذربایجان شرقی", cities: ["تبریز", "مراغه", "مرند", "اهر"] },

  { name: "آذربایجان غربی", cities: ["ارومیه", "خوی", "میاندوآب", "بوکان"] },

  { name: "اردبیل", cities: ["اردبیل", "پارس‌آباد", "مشگین‌شهر"] },

  { name: "کرمان", cities: ["کرمان", "رفسنجان", "جیرفت", "سیرجان"] },

  { name: "کرمانشاه", cities: ["کرمانشاه", "اسلام‌آباد غرب", "سنقر"] },

  { name: "کردستان", cities: ["سنندج", "سقز", "مریوان"] },

  { name: "همدان", cities: ["همدان", "ملایر", "نهاوند"] },

  { name: "لرستان", cities: ["خرم‌آباد", "بروجرد", "دورود"] },

  { name: "مرکزی", cities: ["اراک", "ساوه", "خمین"] },

  { name: "قم", cities: ["قم"] },

  { name: "قزوین", cities: ["قزوین", "الوند", "تاکستان"] },

  { name: "زنجان", cities: ["زنجان", "ابهر", "خرمدره"] },

  { name: "گیلان", cities: ["رشت", "انزلی", "لاهیجان", "آستارا"] },

  { name: "مازندران", cities: ["ساری", "بابل", "آمل", "قائم‌شهر", "نوشهر"] },

  { name: "گلستان", cities: ["گرگان", "گنبد", "علی‌آباد"] },

  { name: "بوشهر", cities: ["بوشهر", "دشتستان", "کنگان"] },

  { name: "هرمزگان", cities: ["بندرعباس", "قشم", "میناب"] },

  { name: "خوزستان", cities: ["اهواز", "آبادان", "خرمشهر", "دزفول"] },

  { name: "چهارمحال و بختیاری", cities: ["شهرکرد", "بروجن", "فارسان"] },

  { name: "کهگیلویه و بویراحمد", cities: ["یاسوج", "گچساران", "دهدشت"] },

  { name: "ایلام", cities: ["ایلام", "دهلران", "مهران"] },

  { name: "سیستان و بلوچستان", cities: ["زاهدان", "زابل", "چابهار", "ایرانشهر"] },

  { name: "سمنان", cities: ["سمنان", "شاهرود", "دامغان"] },

  { name: "یزد", cities: ["یزد", "میبد", "اردکان"] }
]
