interface Province {
  name: string;
  cities: string[];
}

const provinces: Province[] = [
  { name: 'تهران', cities: ['تهران', 'شمیرانات', 'ری', 'اسلامشهر', 'پاکدشت', 'رباط کریم'] },
  { name: 'خراسان رضوی', cities: ['مشهد', 'نیشابور', 'سبزوار', 'تربت حیدریه', 'کاشمر', 'قوچان'] },
  { name: 'اصفهان', cities: ['اصفهان', 'کاشان', 'خمینی‌شهر', 'نجف‌آباد', 'شاهین‌شهر', 'فولادشهر'] },
  { name: 'فارس', cities: ['شیراز', 'مرودشت', 'جهرم', 'فسا', 'کازرون', 'لار'] },
  { name: 'آذربایجان شرقی', cities: ['تبریز', 'مراغه', 'مرند', 'اهر', 'میانه', 'بناب'] },
  { name: 'آذربایجان غربی', cities: ['ارومیه', 'خوی', 'بوکان', 'مهاباد', 'میاندوآب', 'سلماس'] },
  { name: 'خوزستان', cities: ['اهواز', 'آبادان', 'دزفول', 'خرمشهر', 'ماهشهر', 'بهبهان'] },
  { name: 'مازندران', cities: ['ساری', 'بابل', 'آمل', 'قائم‌شهر', 'بهشهر', 'تنکابن'] },
  { name: 'گيلان', cities: ['رشت', 'انزلی', 'لاهیجان', 'لنگرود', 'تالش', 'رودسر'] },
  { name: 'کرمان', cities: ['کرمان', 'سیرجان', 'رفسنجان', 'جیرفت', 'بم', 'زرند'] },
  { name: 'البرز', cities: ['کرج', 'فردیس', 'ساوجبلاغ', 'نظرآباد', 'اشتهارد', 'طالقان'] },
  { name: 'قم', cities: ['قم', 'جعفریه', 'دستجرد', 'قنوات', 'کهک', 'سلفچگان'] },
  { name: 'یزد', cities: ['یزد', 'میبد', 'اردکان', 'بافق', 'مهریز', 'ابرکوه'] },
  { name: 'همدان', cities: ['همدان', 'ملایر', 'نهاوند', 'تویسرکان', 'کبودرآهنگ', 'اسدآباد'] },
  { name: 'زنجان', cities: ['زنجان', 'ابهر', 'خرمدره', 'قیدار', 'ماه‌نشان', 'طارم'] },
  { name: 'لرستان', cities: ['خرم‌آباد', 'بروجرد', 'دورود', 'کوهدشت', 'الشتر', 'پلدختر'] },
  { name: 'مرکزی', cities: ['اراک', 'ساوه', 'خمین', 'محلات', 'دلیجان', 'تفرش'] },
  { name: 'هرمزگان', cities: ['بندرعباس', 'میناب', 'قشم', 'کیش', 'بندر لنگه', 'حاجی‌آباد'] },
  { name: 'کردستان', cities: ['سنندج', 'سقز', 'مریوان', 'بانه', 'قروه', 'کامیاران'] },
  { name: 'کرمانشاه', cities: ['کرمانشاه', 'اسلام‌آباد غرب', 'سنقر', 'هرسین', 'کنگاور', 'جوانرود'] },
  { name: 'سیستان و بلوچستان', cities: ['زاهدان', 'زابل', 'چابهار', 'ایرانشهر', 'سراوان', 'خاش'] },
  { name: 'قزوین', cities: ['قزوین', 'تاکستان', 'آبیک', 'بویین زهرا', 'الوند', 'محمدیه'] },
  { name: 'گلستان', cities: ['گرگان', 'گنبد کاووس', 'علی‌آباد', 'کردکوی', 'بندر ترکمن', 'آق‌قلا'] },
  { name: 'سمنان', cities: ['سمنان', 'شاهرود', 'دامغان', 'گرمسار', 'مهدی‌شهر', 'ایوانکی'] },
  { name: 'بوشهر', cities: ['بوشهر', 'برازجان', 'گناوه', 'کنگان', 'خورموج', 'عسلویه'] },
  { name: 'چهارمحال و بختیاری', cities: ['شهرکرد', 'بروجن', 'لردگان', 'فارسان', 'اردل', 'کیار'] },
  { name: 'کهگیلویه و بویراحمد', cities: ['یاسوج', 'دوگنبدان', 'دهدشت', 'لیکک', 'سی‌سخت', 'چرام'] },
  { name: 'خراسان جنوبی', cities: ['بیرجند', 'قائن', 'طبس', 'فردوس', 'نهبندان', 'بشرویه'] },
  { name: 'خراسان شمالی', cities: ['بجنورد', 'شیروان', 'اسفراین', 'آشخانه', 'جاجرم', 'فاروج'] },
  { name: 'اردبیل', cities: ['اردبیل', 'پارس‌آباد', 'مشگین‌شهر', 'خلخال', 'گرمی', 'نمین'] },
  { name: 'ایلام', cities: ['ایلام', 'دهلران', 'ایوان', 'مهران', 'آبدانان', 'دره‌شهر'] }
];

export { provinces };
